let bosses = [
  {
    id: "LordMarrowgar",
    wowhead: "https://www.wowhead.com/wotlk/npc=36612/lord-marrowgar",
    name: "Lord Marrowgar",
    abilities: [
      {
        abilityId: 69055,
        comment: 'Танки повинні стакнутись і ділити дамаг',
      },
      {
        abilityId: 69146,
        comment: 'Не стояти у вогні. Рдд взяти мінімальний спред',
      },
      {
        abilityId: 69057,
        comment: 'Рдд свічаться в рдд спайки. Мілі свічаться в мілі спайки.',
      },
      {
        abilityId: 69075,
        comment: 'Не стояти в мілі у крутілки. Під початковий каст прожати сакру. Боп + гімн. Боп + транквіл.',
      },
    ]
  },
  {
    id: "LadyDeathwhisper",
    wowhead: "https://www.wowhead.com/wotlk/npc=36855/lady-deathwhisper",
    name: "Lady Deathwhisper",
    abilities: [
      {
        abilityId: 70842,
        comment: 'Фаза 1. Поки не спалиш всю ману, босс не двигається і не пиздить з руки. Наносиш дамаг - палиш ману',
      },
      {
        abilityId: 71254,
        comment: 'Фаза 1. Кастує шадоуболт в поточний таргет',
      },
      {
        abilityId: 71001,
        comment: 'Фаза 1 + Фаза 2. Тупо D&D, як у дк, тіки зелена. Просто вийти з неї.',
      },
      {
        abilityId: 71289,
        comment: 'Фаза 1 + Фаза 2. Бере в МК 3 рандомних гравці. Треба по таймеру просто стопати клів і давати в цих гравців контролі.',
      },
      {
        abilityId: 70901,
        comment: 'Фаза 1. Бафає бомжів.',
      },
      {
        abilityId: 71420,
        comment: 'Просто кікать каст.',
      },
      {
        abilityId: 71204,
        comment: 'Знижує агргогенерацію танка. Босс не таунтиться, тому треба обережно з трітом на дд.',
      },
    ]
  },
  {
    id: "DeathbringerSaurfang",
    wowhead: "https://www.wowhead.com/wotlk/npc=37813/deathbringer-saurfang",
    name: "Deathbringer Saurfang",
    abilities: [
      {
        abilityId: 72371,
        comment: 'Саурфанг стакає на собі баф на + дамаг. 1 енергії = 1% дамага.',
      },
      {
        abilityId: 72178,
        comment: 'Саурфанг отримує +1 енергії кожен раз коли він, або моби наносять дамаг абілкою.',
      },
      {
        abilityId: 72293,
        comment: 'Основна механіка для хілів. Як тіки босс набирає 100 енергії він кидає в рандомний таргет марку. Марка не знімається, залишається на гравці до кінця бою. Наносить фіз дамаг. Можна кинути боп, шоб гравець не отримував дамаг.',
      },
      {
        abilityId: 72737,
        comment: 'На 30% хп босс отримує баф.',
      },
      {
        abilityId: 72385,
        comment: 'Бладбойл, кастується в три рандомних таргета, ніяк не доджиться. Тупо прохілити.',
      },
      {
        abilityId: 72380,
        comment: 'Кастується в рандомний таргет. Наносить дамаг в АоЕ 12 ярдів. Треба спред.',
      },
      {
        abilityId: 72408,
        comment: 'Основна механіка для танків. Кидається в поточного танка. Другий танк в цей момент повинен забрати босса.',
      },
      {
        abilityId: 72173,
        comment: 'Босс викликає 5 мобів, яких потрібно таргетно злити. Є штраф на АоЕ по ним. Цим займаються РДД. * Мобів можна сповільнювати, станити, відкидати.',
      },
    ],
  },
  {
    id: "Festergut",
    wowhead: "https://www.wowhead.com/wotlk/npc=36626/festergut",
    name: "Festergut",
    abilities: [
      {
        abilityId: 69161,
        comment: 'Наповнює кімнату газом і дамажить всіх гравців. Треба просто прохілить.',
      },
      {
        abilityId: 69165,
        comment: 'Стакає баф на боссі. 1 стак = 30% бонус дамаг. Максимум 3 стака.',
      },
      {
        abilityId: 69195,
        comment: 'Наносить дамаг по всьому рейду. Майже гарантований ваншот. Кастується замість кожного четвертого "Gaseous Blight". Скидає стаки бонус дамага з босса.',
      },
      {
        abilityId: 69279,
        comment: 'Основнап механіка для рейду. Спора, виглядає як спори на лотхібі. Вішається на три рандомних гравці. Наносить відносно малий дамаг в АоЕ, але дає можливість задоджити Pungent Blight. 1 гравець повинен зайти в мілі, 1 в рдд. В цих гравців потрібно стакнутись.',
      },
      {
        abilityId: 72219,
        comment: 'Основна механіка для танків. Стакає дебаф на танку. Який дає +10% до дамага.',
      },
      {
        abilityId: 72227,
        comment: 'Якшо на танку настакається 10 стаків дебафа, то його ваншотне, а по рейду пройде ~50к дамага. Це 99% вайп.',
      },
      {
        abilityId: 72272,
        comment: 'Кидається в рандомний таргет. Дізорієнт + дамаг. Дамажить всіх в АоЕ 8 ярдів. Доджиться спредом.',
      },
    ],
  },
  {
    id: "Rotface",
    wowhead: "https://www.wowhead.com/wotlk/npc=36627/rotface",
    name: "Rotface",
    abilities: [
      {
        abilityId: 69789,
        comment: 'Під час бою з боссом кімната буде частково затоплюватись зеленим слизом. Стояти в ньому не можна, він сповільнює і наносить дамаг.',
      },
      {
        abilityId: 69508,
        comment: 'Вибирає рандомний таргет і кастує в нього конусну АоЕшку. Просто відійдіть від морди.',
      },
      {
        abilityId: 69674,
        comment: 'Кидає в рандомний таргет дебаф. Наносить ~5к дамага. Знижує хіл на 75%. Через 12 секунд дебаф пропадає і на місці цього гравця спавниться маленький слизнюк. Слинзнюків має забрати оффтанк і кайтити під станками. Якшо в гравця кидається дебаф він повинен винести його між слизнюками які вже є і оффтанком. Шоб стакнути слизнюків.',
      },
      {
        abilityId: 69774,
        comment: 'Слизнюки плюють в свій таргет зелену соплю. Дамажить в АоЕ і сповільнює.',
      },
      {
        abilityId: 69750,
        comment: 'Коли маленькі слизнюки стакаються проходить АоЕ дамаг в маленькому радіусі.',
      },
      {
        abilityId: 69760,
        comment: 'Коли великі слизнюки стакаються проходить АоЕ дамаг в маленькому радіусі.',
      },
      {
        abilityId: 69558,
        comment: 'Коли великий слизнюк хаває якогось іншого слизнюка стакає на собі баф на +20% дамага.',
      },
      {
        abilityId: 69839,
        comment: 'Коли великий слизнюк набирає 5 стаків бафа він взривається і розлітається на 8 кусків, які нанесуть по ~15к дамага в рандомних гравців і АоЕ в 6 ярдів. Треба спред.',
      },
    ],
  },
  {
    id: "ProfessorPutricide",
    wowhead: "https://www.wowhead.com/wotlk/npc=36678/professor-putricide",
    name: "Professor Putricide",
    abilities: [
      {
        abilityId: 70346,
        comment: 'Зелена калюжа, дамажить і росте з часом. Треба випивати зомбаком. Регенить зомбаку енергію.',
      },
      {
        abilityId: 70351,
        comment: 'Проф. спавнить слизнюків. Оранжевих (Gas Cloud)/зелених (Ooze Cloud). Слизнюків треба таргетно убити. Вони не танчаться, обираються рандомний таргет і тупо йдуть до нього. Убити потрібно до того як слизнюк дойде до таргета.',
      },
      {
        abilityId: 70352,
        comment: 'Проф. дебафає рандомного гравця. Цей гравець може бити тіки зелених слизнюків (Ooze Cloud)',
      },
      {
        abilityId: 70353,
        comment: 'Проф. дебафає рандомного гравця. Цей гравець може бити тіки оранжевих слизнюків (Gas Cloud)',
      },
      {
        abilityId: 71255,
        comment: 'Проф позаду себе спавнить дві оранжевих бомби. Танк повинен відвести босса, шоб не вайпнути мілікемп.',
      },
      {
        abilityId: 71621,
        comment: 'Перефазовка на 80% і 35% хп босса. Проф іде до свого стола і афк кастить хуйню.',
      },
      {
        abilityId: 71603,
        comment: 'Баф на боссі +50% хаста і +50% дамаг',
      },
      {
        abilityId: 72295,
        comment: 'Босс кидає зелений шар в рандомний таргет і він пригає. Наносить АоЕ дамаг і дебафає хасту на 200%. Треба відбігти.',
      },
      {
        abilityId: 70405,
        comment: 'Фаза 3. Стакає на танку дебаф. Дебаф дамажить рейд, з кожним стаком все більше. Якшо дебаф спаде з танка/танк помре - босс похілиться.',
      },
      {
        abilityId: 70672,
        comment: 'Оранжевий слизнюк вішає на свій таргет 10 стаків дебафа. З кожною секундою 1 стак зникає.',
      },
      {
        abilityId: 70701,
        comment: 'Оранжевий слизнюк, коли доходить до свого таргета наносить рейду дамаг в залежності від кількості стаків дебафа на таргеті.',
      },
      {
        abilityId: 70447,
        comment: 'Зелений слизнюк, рутає свій таргет. Якшо доходить, то наносить ~250к дамага, в АоЕ. Цей дамаг сплітається на всіх хто його отримав',
      },
      {
        abilityId: 70311,
        comment: 'Гравець випиває банку зі столу профа "DRINK ME". І перетворюється на зомбака. Зомбак розвалюється на третій фазі і калюжі пити вже нікому, з часом вони заповнять всю кімнату. (софтенрейдж)',
      },
      {
        abilityId: 70360,
        comment: 'Абілка зомбака. Випиває зелену калюжу.',
      },
      {
        abilityId: 70539,
        comment: 'Абілка зомбака. Дамажить таргет і сповільнює на 50%',
      },
      {
        abilityId: 70542,
        comment: 'Абілка зомбака. Дамажить і знижує армор таргета на 4%, 5 стаків. Тупо сандер.',
      },
      {
        abilityId: 70911,
        comment: 'Чума, вішається на рандомний таргет. Не декурситься, не діспелиться, не лічиться. З кожним тіком дамаг від чуми зростає. Чума перекидається на сусідній таргет',
      },
      {
        abilityId: 70953,
        comment: 'Коли гравець скинув чуму, він отримує цей дебаф. Збільшує кількість дамага від чуми на 250%. Цей гравець повинен доджити чуму.',
      },
    ],
  },
  {
    id: "BloodPrinceConcuil",
    wowhead: "https://www.wowhead.com/wotlk/npc=37970",
    name: "Blood Prince Concuil",
    abilities: [
      {
        abilityId: 73001,
        comment: 'Коли гравець рухається він отримує дамаг і стак дебафа. З кожним стаком дебафа дамаг збільшується, 10 сек на місці - стаки скидаються.',
      },
      {
        abilityId: 71943,
        comment: 'Келесет. Спавнить шадоу орби, вони дамажать свій таргет по 1000 і стакають дебаф на зниження входящого шадоу дамага.',
      },
      {
        abilityId: 71405,
        comment: 'Келесет. Шадоуболт в свій таргет ~19к',
      },
      {
        abilityId: 70981,
        comment: 'Келесет. Босс тупо бафається і може кастанути імпрувнутий шб',
      },
      {
        abilityId: 71815,
        comment: 'Келесет. Імпрувнутий шб в свій таргет. ~97к',
      },
      {
        abilityId: 71807,
        comment: 'Талдарам. Конусне АоЕ перед їбалом. Дамажить 8 секунд, сповільнює. Не стояти перед їбалом.',
      },
      {
        abilityId: 71718,
        comment: 'Талдарам. Кидає вогняний шар в рандомний таргет і наносить дамаг в АоЕ 15 ярдів. Треба відійти від таргета. Летить повільно.',
      },
      {
        abilityId: 70982,
        comment: 'Талдарам. Босс тупо бафається і може кастанути імпрувнутий вогняний шар',
      },
      {
        abilityId: 72040,
        comment: 'Талдарам. Кидає імпрувнутий вогняний шар в рандомний таргет і наносить дамаг в АоЕ 15 ярдів. Потрібно стати на шляху вогняного шара, але не біля таргета. Зняти з шара стаки, інакше таргет ваншотне',
      },
      {
        abilityId: 72053,
        comment: 'Валанар. Білий шар, повільно спускається до землі. Якшо спуститься до землі кнокає всіх гравців і дамажить. Якшо орбу продамажити - вона знов підніметься вгору. Зазвичай, на них просто відправляють петів і забиваюють хуй.',
      },
      {
        abilityId: 72037,
        comment: 'Валанар. На землі з\'являється вортекс, який згодом продамажить всіх в радіусі 13 ярдів і відкине. Просто вийти з нього',
      },
      {
        abilityId: 70952,
        comment: 'Валанар. Босс тупо бафається і може кастанути імпрувнутий вортекс',
      },
      {
        abilityId: 72039,
        comment: 'Валанар. Вішає на всіх гравців дебаф, який згодом візрветься і відкине сусідніх гравців. потрібно спреднутись /range 12',
      },
    ],
  },
  {
    id: "Blood-QueenLana'Thel",
    wowhead: "https://www.wowhead.com/wotlk/npc=37955/blood-queen-lanathel",
    name: "Blood-Queen Lana'Thel",
    abilities: [
      {
        abilityId: 70986,
        comment: 'Просто аура яка дамажить, не доджиться, треба прохілювати',
      },
      {
        abilityId: 71623,
        comment: 'Дотка, яка вішається в ОТ',
      },
      {
        abilityId: 70821,
        comment: 'Дебаф, який вішається в найближчий до МТ таргет (повинен бути ОТ). І наносить 100% від дамага який отримує МТ в ОТ, як шадоудамаг.',
      },
      {
        abilityId: 71726,
        comment: 'Ланатель кусає рандомний таргет (1 раз за файт) і перетворює його в вампіра',
      },
      {
        abilityId: 70867,
        comment: 'Коли Ланатель укусила гравця, на ньому з\'являється дебаф. Який дає +100% дамага. Гравець хілиться від свого дамага і не генерує тріт.',
      },
      {
        abilityId: 70877,
        comment: 'Дебаф на "вампірі", потрібно вкусити когось в рейді, бо попадеш в МК',
      },
      {
        abilityId: 70923,
        comment: 'Якшо гравець не кусає когось за 15 секунд він потрапляє в МК. Скоріше всього, це вайп',
      },
      {
        abilityId: 71340,
        comment: 'Зв\'язує рандомних гравцім червоними лучиками, гравці дамажать сусідні таргети. Гравці повинні збігтись і лучики пропадуть.',
      },
      {
        abilityId: 71265,
        comment: 'Дебаф, спавнить під тобою войдзони. ~джераксус файт. Войдзони потрібно ШВИДКО винести під стіни.',
      },
      {
        abilityId: 71446,
        comment: 'АоЕ 6 ярдів в рандомний таргет. РДД повинні спреднутись. Мілі поділитись на 2 кемпа',
      },
      {
        abilityId: 71772,
        comment: 'Фаза 2. Ланатель злітає і спамить свої АоЕшки. Рейд повинен спреднутись',
      },
    ],
  },
  {
    id: "ValithriaDramwalker",
    wowhead: "https://www.wowhead.com/wotlk/npc=36789/valithria-dreamwalker",
    name: "Valithria Dramwalker",
    abilities: [
      {
        abilityId: 72482,
        comment: 'Під час бою з боссом з\'являються портали. Спочатку це просто зелені кружечки, згодом на їх місці з\'являться портали. Хіли (хпали/шаман) повинні зайти в ці портали',
      },
      {
        abilityId: 70873,
        comment: 'В порталах є зелені сфери, коли гравець торкається цих сфер вони взриваються і вішають дебаф на гравців в невеликому АоЕ. Дебаф стакається і дає багато МП5 і +хіл',
      },
    ],
  },
  {
    id: "Sindragosa",
    wowhead: "https://www.wowhead.com/wotlk/npc=36853/sindragosa",
    name: "Sindragosa",
    abilities: [
      {
        abilityId: 70084,
        comment: 'Phase 1/3: Land. Фростаура, яка просто дамажить весь рейд. Як сапфірон в наксі.',
      },
      {
        abilityId: 19983,
        comment: 'Phase 1/3: Land. Клів перед їбалом. Як любий дракон.',
      },
      {
        abilityId: 71077,
        comment: 'Phase 1/3: Land. Пиздить хвостом. Як любий дракон.',
      },
      {
        abilityId: 69649,
        comment: 'Phase 1/3: Land. Конусна АоЕшка перед їбалом.',
      },
      {
        abilityId: 70107,
        comment: 'Phase 1/3: Land. Фіз атаки стакають дебаф. Каждий стак 1000 дамага/2 сек.',
      },
      {
        abilityId: 69762,
        comment: 'Phase 1/3: Land. Дебаф. Поки він на тобі є і ти шось кастуєш. Ти стакаєш дебаф. І получаєш в їбало 2к дамага. Більше кастуєш - більше дамага получаєш. - За кожен каст вішається стак дебафу Instability',
      },
      {
        abilityId: 69766,
        comment: 'Phase 1/3: Land. Після закінченння дебафу Unchained Magic або коли ти перестанеш кастувати, через 5 сек , в залежності від кількості стаків ти взриваєшся в АОЕ, можна подохнути і ваншотнути всіх навколо.',
      },
      {
        abilityId: 70117,
        comment: 'Phase 1/3: Land. Стягує весь рейд в центр модельки босса',
      },
      {
        abilityId: 70123,
        comment: 'Phase 1/3: Land. Потрібно просто відбігти, якщо не встигаєш - жмеш імун, бо ваншот.',
      },
      {
        abilityId: 70126,
        comment: 'Phase 2: Air. Відмічає рандомних гравців, в них згодом кинеться томба',
      },
      {
        abilityId: 70157,
        comment: 'Phase 2: Air. Томба, дамажить і заморожує гравця і всіх в радіусі 10. Гравців потрібно прохілити. Томби убити під кінець Air фази, а не одразу.',
      },
      {
        abilityId: 70521,
        comment: 'Phase 2: Air. Поки Сіндрагоса літає вона плює АоЕшки в рандомне місце на платформі, спочатку це виглядає як синє коло, потім туди прилітає сфера. Доджиться заходом за томбу. Якшо не задоджив і не фул хп = смерть',
      },
      {
        abilityId: 70128,
        comment: 'Phase 3: Land. Сіндрагоса дебафає всіх кого бачить на 15% входящого маг. дамага. Кожні 5 сек. Можна доджити за томбою.',
      },
      {
        abilityId: 70157,
        comment: 'Phase 3: Land. Сіндрагоса кидає в рандомний таргет томбу, гравець повинен вибігти із рейда, щоб нікого не задамажити. І щоб всім було зручно зайти за томбу.',
      },
    ]
  },
  {
    id: "TheLichKing",
    wowhead: "https://www.wowhead.com/wotlk/npc=36597/the-lich-king",
    name: "The Lich King",
    abilities: [
      {
        abilityId: 70358,
        comment: 'Призиває 3 гулі, ОТ забирає.',
      },
      {
        abilityId: 70372,
        comment: 'Призиває здорового врайкула, ОТ забирає.',
      },
      {
        abilityId: 72149,
        comment: 'Конусна АоЕшка врайкула',
      },
      {
        abilityId: 72143,
        comment: 'Врайкул бафається на х2 дамаг.',
      },
      {
        abilityId: 73539,
        comment: 'Призиває під рандомним таргетом войдзону, войдзона тамажить через 3 секунди, потрібно вийти. РДД рухаються одним кемпом і потихеньку засирають платформу цими войдзонами.',
      },
      {
        abilityId: 70337,
        comment: 'Болячка, вішається на рандомний таргет. 15 секунд, дамажить кожних 5 секунд по 50к. При діспелі перекидається на інший рандомний таргет. При розвіюванні (діспел, смерть таргета) бафає ліча на 2% дамага. Треба виносити до ОТ, щоб чума  після діспелу переходила на Адів, яких танчить ОТ.',
      },
      {
        abilityId: 70541,
        comment: 'Дебаф, вішається на рандомний таргет, продамажує весь рейд при навішуванні і додатково вішає доту на таргет, яка з часом сильніше дамажить, зникає коли прохілити таргет на 90%+ хп. ',
      },
      {
        abilityId: 69037,
        comment: 'Вйобує в танка 70к дамага і бафає ліча на 100% хаст на 5 секунд.',
      },
      {
        abilityId: 69409,
        comment: 'Сумонить валькірію, яка хватає рандомного гравця і виносить з платформи. Валькірію можно сповільнювати, і потрібно вбити. * Якшо валькірія взяла варлока, або ханта, то в них є портал/відрив і валькірію можна ігнорувати.',
      },
      {
        abilityId: 72754,
        comment: 'Здорова чорна войдзона. Якшо гравці отримають від неї дамаг - вона росте. Потрібно вибігати МОМЕНТАЛЬНО.',
      },
      {
        abilityId: 68981,
        comment: 'Ліч пиздує в центр і начинає АоЕшити в 45 ярдів. Піднімається пол на краю платформи. Треба с\'їбать на край платформи.',
      },
      {
        abilityId: 72262,
        comment: 'Після каста АоЕшки край платформи обсипається, треба с\'їбать з края платформи, пока він не обвалився.',
      },
      {
        abilityId: 69103,
        comment: 'Призиває льодяні сфери, які летять до рандомного гравця з центру кімнати, їх потрібно вбити (РДД)',
      },
      {
        abilityId: 72133,
        comment: 'Конусне АоЕ',
      },
      {
        abilityId: 69200,
        comment: 'Дух, який б\'є рандомний таргет, його потрібно вбити. ОТ танчить.',
      },
      {
        abilityId: 69242,
        comment: 'У Raging Spirit є конусне АоЕ з сайленсом. Потрібно відвертати від рейда.',
      },
    ],
  },
];

const content = document.getElementById("content");
const navList = document.getElementById("navList");
bosses.forEach(boss => {
  const listEl = document.createElement("li");
  const listLink = document.createElement("a");
  listLink.innerText = boss.name;
  listLink.setAttribute("href", `#${boss.id}`);
  listEl.appendChild(listLink);
  navList.appendChild(listEl);

  const article = document.createElement("article");
  article.setAttribute("id", boss.id);
  const title = document.createElement("h5");
  const link = document.createElement("a");
  link.setAttribute("href", boss.wowhead);
  link.setAttribute("target", "_blank");
  link.innerText = boss.name;
  title.appendChild(link);
  title.innerHTML += ' 🔗';
  article.appendChild(title);
  content.appendChild(article);

  if (boss.abilities) {
    const abilitiesTable = document.createElement("table");
    boss.abilities.forEach(ability => {
      const abilitiesTableRow = document.createElement("tr");
      const abilitiesTableCell1 = document.createElement("td");
      const abilitiesTableCell2 = document.createElement("td");
      
      const abilitiesListLink = document.createElement("a");
      abilitiesListLink.setAttribute("href", `https://www.wowhead.com/wotlk/spell=${ability.abilityId}`);
      abilitiesListLink.setAttribute("target", "_blank");

      const abilitiesListComment = document.createElement("span");
      abilitiesListComment.innerText = ability.comment;

      abilitiesTableCell1.appendChild(abilitiesListLink);
      abilitiesTableCell2.appendChild(abilitiesListComment);
      abilitiesTableRow.appendChild(abilitiesTableCell1);
      abilitiesTableRow.appendChild(abilitiesTableCell2);
      abilitiesTable.appendChild(abilitiesTableRow);
    });
    article.appendChild(abilitiesTable);
  }
});
